app/controllers/students_controller.rb

  def show
    @student = Student.find_by(id: [params[:id]])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = 1 LIMIT ?  [["LIMIT", 1]]